package com.lena.homework.ex1;

/* Задание 1
Создать текстовый файл с именем HelloWorld.java с содержанием "Hello World!", откомпилировать его и запусть
Добавлены текст и специальные символы. Текст должен выводиться в консоли в виде лесенки предложений.
 */
public class HelloWorld {
    public static void main(String[] args) {
        System.out.println("Hello World!!!\n" + "\n\tI learn Java. I like it!\n" + "\n\t\tBecause: \"Java rocks!!!\"");
    }
}
